Revit 2027 API
WallSweepInfo(Boolean, WallSweepType) Constructor
 Constructs a new WallSweepInfo instance.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public WallSweepInfo(
	bool fixed,
	WallSweepType type
)
Public Sub New (
	fixed As Boolean,
	type As WallSweepType
)
public:
WallSweepInfo(
	bool fixed,
	WallSweepType type
)
new :
        fixed : bool *
        type : WallSweepType -> WallSweepInfo
Parameters
fixed Boolean
 True if the WallSweepInfo should be fixed (suitable for use in CompoundStructure.AddWallSweep()). False if the WallSweepInfo should be suitable for use in standalone wall sweep or reveal elements.
type WallSweepType
 The type of the WallSweepInfo instance.
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  A value passed for an enumeration argument is not a member of that enumeration
See Also
Reference
WallSweepInfo Class
WallSweepInfo Overload
Autodesk.Revit.DB Namespace